Autodesk.Revit.DB.Structure.AnalyticalModelSelector.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.AnalyticalModelSelector.CurveSelector
The portion of the curve to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor(Autodesk.Revit.DB.Curve)
Creates a selector based on a specific analytical curve.
curve:
The curve upon which this selector acts.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Structure.AnalyticalCurveSelector)
Creates a selector based on one portion of a specific analytical curve.
curve:
The curve upon which this selector acts.
inCurveSelector:
Portion of the analytical curve in which the client is interested.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor
Creates a selector for the analytical model geometry.
Remarks:
This version is useful for single-curve or single-point analytical models.
Additionally, this only acts with respect to the entire curve or point.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor(Autodesk.Revit.DB.Structure.AnalyticalCurveSelector)
Creates a selector for the analytical model geometry.
Remarks:
This version is useful for single-curve or single-point analytical models.
inCurveSelector:
Portion of the analytical curve in which the client has interest.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModelSelector
Defines a portion of an Analytical Model for an Element.
Remarks:
This is used to identify the portion of an analytical model of interest to a client.
To identify the portion of the analytical model, the client must identify
the curve in question, by using one of the following:
The specific curve within the analytical model.The index of the curve within the analytical model.
If a specific part of that curve is of interest, the client needs to identify that by
specifying one of the following:
The start of the curve.The end of the curve.The entire curve.  This is the default behavior, so this does not need specifying.
Since:
2011